{smcl}
{com}{sf}{ul off}{txt}
{com}. capture program drop _all
{txt}
{com}. capture estimates drop _all
{txt}
{com}. clear all
{txt}
{com}. set more off
{txt}
{com}. 
. capture cd "D:/Lindo/Assignments/Assignment5"
{txt}
{com}. 
. if c(username)=="xueqingyan" {c -(}
.         cd "C:\Users\yanxueqing\Desktop\ECMT 676 Assignments\Assignment 5"
. {c )-}
{txt}
{com}. 
. use "runandjump_sample1500g.dta"
{txt}
{com}. 
. *normalize birth weight
. gen bwtnorm = bweight - 1500
{txt}
{com}. 
. 
. ***************
. **     A1    **
. ***************
. 
. * bingen generates a variable indicating bins that radiate out from 0.
. * the bins are represented by their middle values.
. 
. program bingen
{txt}  1{com}.         syntax  , varname(string) binname(string) [binlen(real 10)]
{txt}  2{com}.         tokenize `varname'
{txt}  3{com}.         local vn `1'
{txt}  4{com}.         tokenize `binname'
{txt}  5{com}.         local bn `1'
{txt}  6{com}.         gen `bn' = `binlen' / 2 + `binlen' * floor(`vn' / `binlen')
{txt}  7{com}. end
{txt}
{com}. 
. * generate bins of length 1, 10, 25
. 
. local binlens 01 10 25
{txt}
{com}. 
. foreach l of local binlens{c -(}
{txt}  2{com}.         bingen , varname(bwtnorm) binname(bin`l') binlen(`l')
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * save main data
. tempfile raw
{txt}
{com}. save "`raw'"
{txt}file C:\Users\Xue\AppData\Local\Temp\ST_07000001.tmp saved

{com}. 
. tempfile bin01
{txt}
{com}. tempfile bin10
{txt}
{com}. tempfile bin25
{txt}
{com}. 
. local bins bin01 bin10 bin25
{txt}
{com}. 
. foreach bin of local bins{c -(}
{txt}  2{com}.         use `raw' , clear
{txt}  3{com}.         collapse (count) freq=bwtnorm , by(`bin')
{txt}  4{com}.         graph twoway scatter freq `bin' , ytitle(freq) ///
>       name("graph_`bin'") title("Frequencies for `bin'")
{txt}  5{com}. save ``bin''
{txt}  6{com}.         
. {c )-}
{res}{txt}file C:\Users\Xue\AppData\Local\Temp\ST_07000002.tmp saved
{res}{txt}file C:\Users\Xue\AppData\Local\Temp\ST_07000003.tmp saved
{res}{txt}file C:\Users\Xue\AppData\Local\Temp\ST_07000004.tmp saved

{com}. 
. ***************
. **     A2    **
. ***************
. 
. foreach bin of local bins{c -(}
{txt}  2{com}. 
.         use ``bin'' , clear
{txt}  3{com}.         gen cut = 1 if `bin' < 0
{txt}  4{com}.         replace cut = 0 if cut ==.
{txt}  5{com}.         gen inter = cut * `bin'
{txt}  6{com}.         
.         forvalues bw = 150(-50)50 {c -(}
{txt}  7{com}.                 display "`bin', bandwith=`bw':"
{txt}  8{com}.                 regress freq cut `bin' inter if abs(`bin') < `bw'
{txt}  9{com}.         {c )-}
{txt} 10{com}. {c )-}
{txt}(151 missing values generated)
(151 real changes made)
bin01, bandwith=150:

      Source {c |}       SS           df       MS      Number of obs   ={res}       300
{txt}{hline 13}{c +}{hline 34}   F(3, 296)       = {res}     0.24
{txt}       Model {c |} {res}   12735448         3  4245149.32   {txt}Prob > F        ={res}    0.8693
{txt}    Residual {c |} {res} 5.2635e+09       296  17782115.3   {txt}R-squared       ={res}    0.0024
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0077
{txt}       Total {c |} {res} 5.2762e+09       299  17646292.9   {txt}Root MSE        =   {res} 4216.9

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        freq{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}cut {c |}{col 14}{res}{space 2}-447.1754{col 26}{space 2}  973.864{col 37}{space 1}   -0.46{col 46}{space 3}0.646{col 54}{space 4} -2363.75{col 67}{space 3} 1469.399
{txt}{space 7}bin01 {c |}{col 14}{res}{space 2} 1.123803{col 26}{space 2}  7.95161{col 37}{space 1}    0.14{col 46}{space 3}0.888{col 54}{space 4}-14.52505{col 67}{space 3} 16.77266
{txt}{space 7}inter {c |}{col 14}{res}{space 2}-3.018299{col 26}{space 2} 11.24528{col 37}{space 1}   -0.27{col 46}{space 3}0.789{col 54}{space 4}-25.14912{col 67}{space 3} 19.11252
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1356.641{col 26}{space 2} 688.6258{col 37}{space 1}    1.97{col 46}{space 3}0.050{col 54}{space 4} 1.418413{col 67}{space 3} 2711.864
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}bin01, bandwith=100:

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       200
{txt}{hline 13}{c +}{hline 34}   F(3, 196)       = {res}     0.18
{txt}       Model {c |} {res} 8949578.74         3  2983192.91   {txt}Prob > F        ={res}    0.9098
{txt}    Residual {c |} {res} 3.2461e+09       196  16561675.8   {txt}R-squared       ={res}    0.0027
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0125
{txt}       Total {c |} {res} 3.2550e+09       199  16356975.1   {txt}Root MSE        =   {res} 4069.6

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        freq{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}cut {c |}{col 14}{res}{space 2}-740.1982{col 26}{space 2} 1151.101{col 37}{space 1}   -0.64{col 46}{space 3}0.521{col 54}{space 4}-3010.332{col 67}{space 3} 1529.935
{txt}{space 7}bin01 {c |}{col 14}{res}{space 2}-4.347327{col 26}{space 2} 14.09823{col 37}{space 1}   -0.31{col 46}{space 3}0.758{col 54}{space 4}-32.15102{col 67}{space 3} 23.45637
{txt}{space 7}inter {c |}{col 14}{res}{space 2}  1.09949{col 26}{space 2}  19.9379{col 37}{space 1}    0.06{col 46}{space 3}0.956{col 54}{space 4}-38.22087{col 67}{space 3} 40.41985
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1600.046{col 26}{space 2} 813.9513{col 37}{space 1}    1.97{col 46}{space 3}0.051{col 54}{space 4}-5.180578{col 67}{space 3} 3205.273
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}bin01, bandwith=50:

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       100
{txt}{hline 13}{c +}{hline 34}   F(3, 96)        = {res}     0.50
{txt}       Model {c |} {res} 22552516.1         3  7517505.37   {txt}Prob > F        ={res}    0.6802
{txt}    Residual {c |} {res} 1.4308e+09        96  14903933.9   {txt}R-squared       ={res}    0.0155
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0152
{txt}       Total {c |} {res} 1.4533e+09        99  14680102.7   {txt}Root MSE        =   {res} 3860.6

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        freq{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}cut {c |}{col 14}{res}{space 2}-1611.634{col 26}{space 2} 1544.456{col 37}{space 1}   -1.04{col 46}{space 3}0.299{col 54}{space 4}-4677.355{col 67}{space 3} 1454.087
{txt}{space 7}bin01 {c |}{col 14}{res}{space 2}-38.86756{col 26}{space 2} 37.83319{col 37}{space 1}   -1.03{col 46}{space 3}0.307{col 54}{space 4}-113.9658{col 67}{space 3} 36.23072
{txt}{space 7}inter {c |}{col 14}{res}{space 2} 33.74257{col 26}{space 2} 53.50421{col 37}{space 1}    0.63{col 46}{space 3}0.530{col 54}{space 4}-72.46245{col 67}{space 3} 139.9476
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2319.949{col 26}{space 2} 1092.095{col 37}{space 1}    2.12{col 46}{space 3}0.036{col 54}{space 4} 152.1567{col 67}{space 3} 4487.741
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(16 missing values generated)
(16 real changes made)
bin10, bandwith=150:

      Source {c |}       SS           df       MS      Number of obs   ={res}        30
{txt}{hline 13}{c +}{hline 34}   F(3, 26)        = {res}     0.30
{txt}       Model {c |} {res}  127653492         3  42551164.1   {txt}Prob > F        ={res}    0.8216
{txt}    Residual {c |} {res} 3.6283e+09        26   139548644   {txt}R-squared       ={res}    0.0340
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0775
{txt}       Total {c |} {res} 3.7559e+09        29   129514422   {txt}Root MSE        =   {res}  11813

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        freq{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}cut {c |}{col 14}{res}{space 2}-4270.233{col 26}{space 2} 8641.478{col 37}{space 1}   -0.49{col 46}{space 3}0.625{col 54}{space 4}-22033.05{col 67}{space 3} 13492.58
{txt}{space 7}bin10 {c |}{col 14}{res}{space 2} 13.06929{col 26}{space 2}  70.5966{col 37}{space 1}    0.19{col 46}{space 3}0.855{col 54}{space 4}-132.0441{col 67}{space 3} 158.1827
{txt}{space 7}inter {c |}{col 14}{res}{space 2}-31.15857{col 26}{space 2} 99.83867{col 37}{space 1}   -0.31{col 46}{space 3}0.757{col 54}{space 4}-236.3799{col 67}{space 3} 174.0628
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 13429.07{col 26}{space 2} 6110.448{col 37}{space 1}    2.20{col 46}{space 3}0.037{col 54}{space 4} 868.8655{col 67}{space 3} 25989.27
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}bin10, bandwith=100:

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        20
{txt}{hline 13}{c +}{hline 34}   F(3, 16)        = {res}     0.20
{txt}       Model {c |} {res} 88287924.2         3  29429308.1   {txt}Prob > F        ={res}    0.8930
{txt}    Residual {c |} {res} 2.3225e+09        16   145153302   {txt}R-squared       ={res}    0.0366
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.1440
{txt}       Total {c |} {res} 2.4107e+09        19   126881092   {txt}Root MSE        =   {res}  12048

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        freq{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}cut {c |}{col 14}{res}{space 2}-7335.794{col 26}{space 2} 10816.76{col 37}{space 1}   -0.68{col 46}{space 3}0.507{col 54}{space 4}-30266.31{col 67}{space 3} 15594.72
{txt}{space 7}bin10 {c |}{col 14}{res}{space 2}-41.95879{col 26}{space 2} 132.6437{col 37}{space 1}   -0.32{col 46}{space 3}0.756{col 54}{space 4}-323.1508{col 67}{space 3} 239.2332
{txt}{space 7}inter {c |}{col 14}{res}{space 2} 9.289697{col 26}{space 2} 187.5865{col 37}{space 1}    0.05{col 46}{space 3}0.961{col 54}{space 4}-388.3758{col 67}{space 3} 406.9552
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 15924.74{col 26}{space 2} 7648.606{col 37}{space 1}    2.08{col 46}{space 3}0.054{col 54}{space 4}-289.5818{col 67}{space 3} 32139.06
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}bin10, bandwith=50:

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        10
{txt}{hline 13}{c +}{hline 34}   F(3, 6)         = {res}     0.25
{txt}       Model {c |} {res}  122424828         3  40808276.1   {txt}Prob > F        ={res}    0.8620
{txt}    Residual {c |} {res}  998734214         6   166455702   {txt}R-squared       ={res}    0.1092
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.3362
{txt}       Total {c |} {res} 1.1212e+09         9   124573227   {txt}Root MSE        =   {res}  12902

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        freq{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}cut {c |}{col 14}{res}{space 2} -11093.7{col 26}{space 2} 16572.63{col 37}{space 1}   -0.67{col 46}{space 3}0.528{col 54}{space 4}-51645.45{col 67}{space 3} 29458.05
{txt}{space 7}bin10 {c |}{col 14}{res}{space 2}  -238.61{col 26}{space 2} 407.9898{col 37}{space 1}   -0.58{col 46}{space 3}0.580{col 54}{space 4}-1236.925{col 67}{space 3} 759.7052
{txt}{space 7}inter {c |}{col 14}{res}{space 2}    238.2{col 26}{space 2} 576.9848{col 37}{space 1}    0.41{col 46}{space 3}0.694{col 54}{space 4}-1173.631{col 67}{space 3} 1650.031
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 19447.85{col 26}{space 2} 11718.62{col 37}{space 1}    1.66{col 46}{space 3}0.148{col 54}{space 4} -9226.57{col 67}{space 3} 48122.27
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(7 missing values generated)
(7 real changes made)
bin25, bandwith=150:

      Source {c |}       SS           df       MS      Number of obs   ={res}        12
{txt}{hline 13}{c +}{hline 34}   F(3, 8)         = {res}     3.72
{txt}       Model {c |} {res}  405391579         3   135130526   {txt}Prob > F        ={res}    0.0609
{txt}    Residual {c |} {res}  290563099         8  36320387.4   {txt}R-squared       ={res}    0.5825
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4259
{txt}       Total {c |} {res}  695954678        11  63268607.1   {txt}Root MSE        =   {res} 6026.6

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        freq{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}cut {c |}{col 14}{res}{space 2}-13216.73{col 26}{space 2} 7033.129{col 37}{space 1}   -1.88{col 46}{space 3}0.097{col 54}{space 4}-29435.16{col 67}{space 3} 3001.692
{txt}{space 7}bin25 {c |}{col 14}{res}{space 2}    47.48{col 26}{space 2}  57.6257{col 37}{space 1}    0.82{col 46}{space 3}0.434{col 54}{space 4} -85.4051{col 67}{space 3} 180.3651
{txt}{space 7}inter {c |}{col 14}{res}{space 2} -141.392{col 26}{space 2} 81.49504{col 37}{space 1}   -1.73{col 46}{space 3}0.121{col 54}{space 4}-329.3199{col 67}{space 3} 46.53591
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 32462.17{col 26}{space 2} 4973.173{col 37}{space 1}    6.53{col 46}{space 3}0.000{col 54}{space 4} 20994.01{col 67}{space 3} 43930.33
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}bin25, bandwith=100:

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         8
{txt}{hline 13}{c +}{hline 34}   F(3, 4)         = {res}     2.68
{txt}       Model {c |} {res}  360303867         3   120101289   {txt}Prob > F        ={res}    0.1824
{txt}    Residual {c |} {res}  179276727         4  44819181.8   {txt}R-squared       ={res}    0.6677
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4186
{txt}       Total {c |} {res}  539580594         7    77082942   {txt}Root MSE        =   {res} 6694.7

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        freq{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}cut {c |}{col 14}{res}{space 2}   -20013{col 26}{space 2} 9701.561{col 37}{space 1}   -2.06{col 46}{space 3}0.108{col 54}{space 4}-46948.85{col 67}{space 3} 6922.851
{txt}{space 7}bin25 {c |}{col 14}{res}{space 2}    29.84{col 26}{space 2} 119.7587{col 37}{space 1}    0.25{col 46}{space 3}0.816{col 54}{space 4}-302.6634{col 67}{space 3} 362.3434
{txt}{space 7}inter {c |}{col 14}{res}{space 2}  -279.72{col 26}{space 2} 169.3643{col 37}{space 1}   -1.65{col 46}{space 3}0.174{col 54}{space 4}-749.9508{col 67}{space 3} 190.5108
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    33075{col 26}{space 2} 6860.039{col 37}{space 1}    4.82{col 46}{space 3}0.009{col 54}{space 4} 14028.48{col 67}{space 3} 52121.52
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}bin25, bandwith=50:

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         4
{txt}{hline 13}{c +}{hline 34}   F(3, 0)         = {res}        .
{txt}       Model {c |} {res}  446995413         3   148998471   {txt}Prob > F        ={res}         .
{txt}    Residual {c |} {res}          0         0           .   {txt}R-squared       ={res}    1.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}         .
{txt}       Total {c |} {res}  446995413         3   148998471   {txt}Root MSE        =   {res}      0

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        freq{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}cut {c |}{col 14}{res}{space 2} -38534.5{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{space 7}bin25 {c |}{col 14}{res}{space 2}   -80.92{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{space 7}inter {c |}{col 14}{res}{space 2}  -867.72{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  35729.5{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. ***************
. **     A3    **
. ***************
. use `raw' , clear
{txt}
{com}. 
. gen mom_white = 1 if mom_race == "white":racelbl
{txt}(127,748 missing values generated)

{com}. replace mom_white = 0 if mom_white == .
{txt}(127,748 real changes made)

{com}. 
. gen mom_high = 1 if mom_ed < 12
{txt}(282,280 missing values generated)

{com}. replace mom_high = 0 if mom_high ==.
{txt}(282,280 real changes made)

{com}. 
. gen cut = 1 if bwtnorm >= 0
{txt}(157,733 missing values generated)

{com}. replace cut = 0 if cut ==.
{txt}(157,733 real changes made)

{com}. 
. gen inter = bwtnorm * cut
{txt}
{com}. 
. save `raw' , replace
{txt}file C:\Users\Xue\AppData\Local\Temp\ST_07000001.tmp saved

{com}. 
. local chars mom_white mom_high
{txt}
{com}. 
. forvalues bw = 90(-30)30{c -(}
{txt}  2{com}.         tempvar wght
{txt}  3{com}.         gen `wght' = 1 - abs(bwtnorm / `bw')
{txt}  4{com}.         foreach c of local chars{c -(}
{txt}  5{com}.                 display "reg: `c', bandwith: `bw', triangular kernel"
{txt}  6{com}.                 regress `c' bwtnorm cut inter [pweight=`wght'] ///
>                 if abs(bwtnorm) <= `bw'
{txt}  7{com}.                 display "reg: `c', bandwith: `bw', Rectangular kernel"
{txt}  8{com}.                 regress `c' bwtnorm cut inter ///
>                 if abs(bwtnorm) <= `bw'
{txt}  9{com}.         {c )-}
{txt} 10{com}. {c )-}
reg: mom_white, bandwith: 90, triangular kernel
{txt}(sum of wgt is   1.0864e+05)

Linear regression                               Number of obs     = {res}   230,248
                                                {txt}F(3, 230244)      =  {res}     1.59
                                                {txt}Prob > F          = {res}    0.1900
                                                {txt}R-squared         = {res}    0.0000
                                                {txt}Root MSE          =    {res} .47383

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   mom_white{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}bwtnorm {c |}{col 14}{res}{space 2}-.0001098{col 26}{space 2} .0000826{col 37}{space 1}   -1.33{col 46}{space 3}0.184{col 54}{space 4}-.0002717{col 67}{space 3} .0000522
{txt}{space 9}cut {c |}{col 14}{res}{space 2} .0048244{col 26}{space 2} .0047858{col 37}{space 1}    1.01{col 46}{space 3}0.313{col 54}{space 4}-.0045557{col 67}{space 3} .0142044
{txt}{space 7}inter {c |}{col 14}{res}{space 2} .0001878{col 26}{space 2} .0001032{col 37}{space 1}    1.82{col 46}{space 3}0.069{col 54}{space 4}-.0000144{col 67}{space 3}   .00039
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .6540018{col 26}{space 2} .0040418{col 37}{space 1}  161.81{col 46}{space 3}0.000{col 54}{space 4}   .64608{col 67}{space 3} .6619236
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}reg: mom_white, bandwith: 90, Rectangular kernel

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   233,887
{txt}{hline 13}{c +}{hline 34}   F(3, 233883)    = {res}     4.80
{txt}       Model {c |} {res} 3.22240413         3  1.07413471   {txt}Prob > F        ={res}    0.0024
{txt}    Residual {c |} {res} 52382.8355   233,883  .223970257   {txt}R-squared       ={res}    0.0001
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res}  52386.058   233,886  .223981162   {txt}Root MSE        =   {res} .47325

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   mom_white{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}bwtnorm {c |}{col 14}{res}{space 2} -.000036{col 26}{space 2} .0000628{col 37}{space 1}   -0.57{col 46}{space 3}0.566{col 54}{space 4}-.0001592{col 67}{space 3} .0000871
{txt}{space 9}cut {c |}{col 14}{res}{space 2} .0011954{col 26}{space 2} .0042226{col 37}{space 1}    0.28{col 46}{space 3}0.777{col 54}{space 4}-.0070808{col 67}{space 3} .0094715
{txt}{space 7}inter {c |}{col 14}{res}{space 2} .0001541{col 26}{space 2} .0000752{col 37}{space 1}    2.05{col 46}{space 3}0.040{col 54}{space 4} 6.70e-06{col 67}{space 3} .0003016
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .656655{col 26}{space 2} .0035392{col 37}{space 1}  185.54{col 46}{space 3}0.000{col 54}{space 4} .6497182{col 67}{space 3} .6635918
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}reg: mom_high, bandwith: 90, triangular kernel
{txt}(sum of wgt is   1.0864e+05)

Linear regression                               Number of obs     = {res}   230,248
                                                {txt}F(3, 230244)      =  {res}     1.79
                                                {txt}Prob > F          = {res}    0.1469
                                                {txt}R-squared         = {res}    0.0000
                                                {txt}Root MSE          =    {res} .43379

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    mom_high{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}bwtnorm {c |}{col 14}{res}{space 2} .0000512{col 26}{space 2} .0000758{col 37}{space 1}    0.68{col 46}{space 3}0.500{col 54}{space 4}-.0000974{col 67}{space 3} .0001997
{txt}{space 9}cut {c |}{col 14}{res}{space 2} .0020863{col 26}{space 2} .0043867{col 37}{space 1}    0.48{col 46}{space 3}0.634{col 54}{space 4}-.0065115{col 67}{space 3}  .010684
{txt}{space 7}inter {c |}{col 14}{res}{space 2}-.0001767{col 26}{space 2} .0000946{col 37}{space 1}   -1.87{col 46}{space 3}0.062{col 54}{space 4}-.0003622{col 67}{space 3} 8.75e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .252662{col 26}{space 2} .0037012{col 37}{space 1}   68.26{col 46}{space 3}0.000{col 54}{space 4} .2454077{col 67}{space 3} .2599164
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}reg: mom_high, bandwith: 90, Rectangular kernel

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   233,887
{txt}{hline 13}{c +}{hline 34}   F(3, 233883)    = {res}     1.89
{txt}       Model {c |} {res}   1.061171         3  .353723668   {txt}Prob > F        ={res}    0.1294
{txt}    Residual {c |} {res} 43854.8763   233,883  .187507755   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res} 43855.9374   233,886  .187509887   {txt}Root MSE        =   {res} .43302

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    mom_high{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}bwtnorm {c |}{col 14}{res}{space 2} .0000323{col 26}{space 2} .0000575{col 37}{space 1}    0.56{col 46}{space 3}0.574{col 54}{space 4}-.0000803{col 67}{space 3}  .000145
{txt}{space 9}cut {c |}{col 14}{res}{space 2} .0018185{col 26}{space 2} .0038636{col 37}{space 1}    0.47{col 46}{space 3}0.638{col 54}{space 4}-.0057541{col 67}{space 3}  .009391
{txt}{space 7}inter {c |}{col 14}{res}{space 2}-.0001191{col 26}{space 2} .0000688{col 37}{space 1}   -1.73{col 46}{space 3}0.084{col 54}{space 4} -.000254{col 67}{space 3} .0000158
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .2519844{col 26}{space 2} .0032384{col 37}{space 1}   77.81{col 46}{space 3}0.000{col 54}{space 4} .2456374{col 67}{space 3} .2583315
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}reg: mom_white, bandwith: 60, triangular kernel
{txt}(sum of wgt is   7.2904e+04)

Linear regression                               Number of obs     = {res}   158,693
                                                {txt}F(3, 158689)      =  {res}     0.76
                                                {txt}Prob > F          = {res}    0.5157
                                                {txt}R-squared         = {res}    0.0000
                                                {txt}Root MSE          =    {res} .47415

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   mom_white{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}bwtnorm {c |}{col 14}{res}{space 2}  -.00022{col 26}{space 2} .0001628{col 37}{space 1}   -1.35{col 46}{space 3}0.176{col 54}{space 4}-.0005391{col 67}{space 3}  .000099
{txt}{space 9}cut {c |}{col 14}{res}{space 2} .0084344{col 26}{space 2}  .006326{col 37}{space 1}    1.33{col 46}{space 3}0.182{col 54}{space 4}-.0039644{col 67}{space 3} .0208333
{txt}{space 7}inter {c |}{col 14}{res}{space 2} .0002399{col 26}{space 2} .0001984{col 37}{space 1}    1.21{col 46}{space 3}0.227{col 54}{space 4} -.000149{col 67}{space 3} .0006288
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .650969{col 26}{space 2} .0056191{col 37}{space 1}  115.85{col 46}{space 3}0.000{col 54}{space 4} .6399558{col 67}{space 3} .6619823
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}reg: mom_white, bandwith: 60, Rectangular kernel

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   163,422
{txt}{hline 13}{c +}{hline 34}   F(3, 163418)    = {res}     2.72
{txt}       Model {c |} {res} 1.83124249         3  .610414163   {txt}Prob > F        ={res}    0.0426
{txt}    Residual {c |} {res} 36633.0304   163,418  .224167658   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res} 36634.8616   163,421  .224174749   {txt}Root MSE        =   {res} .47346

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   mom_white{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}bwtnorm {c |}{col 14}{res}{space 2}-.0002151{col 26}{space 2} .0001185{col 37}{space 1}   -1.82{col 46}{space 3}0.069{col 54}{space 4}-.0004473{col 67}{space 3} .0000171
{txt}{space 9}cut {c |}{col 14}{res}{space 2} .0067346{col 26}{space 2} .0054273{col 37}{space 1}    1.24{col 46}{space 3}0.215{col 54}{space 4}-.0039029{col 67}{space 3}  .017372
{txt}{space 7}inter {c |}{col 14}{res}{space 2} .0003454{col 26}{space 2} .0001372{col 37}{space 1}    2.52{col 46}{space 3}0.012{col 54}{space 4} .0000765{col 67}{space 3} .0006143
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .6511002{col 26}{space 2} .0047601{col 37}{space 1}  136.78{col 46}{space 3}0.000{col 54}{space 4} .6417706{col 67}{space 3} .6604298
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}reg: mom_high, bandwith: 60, triangular kernel
{txt}(sum of wgt is   7.2904e+04)

Linear regression                               Number of obs     = {res}   158,693
                                                {txt}F(3, 158689)      =  {res}     1.33
                                                {txt}Prob > F          = {res}    0.2626
                                                {txt}R-squared         = {res}    0.0000
                                                {txt}Root MSE          =    {res} .43437

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    mom_high{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}bwtnorm {c |}{col 14}{res}{space 2} .0002018{col 26}{space 2} .0001497{col 37}{space 1}    1.35{col 46}{space 3}0.178{col 54}{space 4}-.0000917{col 67}{space 3} .0004953
{txt}{space 9}cut {c |}{col 14}{res}{space 2}-.0017353{col 26}{space 2} .0058149{col 37}{space 1}   -0.30{col 46}{space 3}0.765{col 54}{space 4}-.0131323{col 67}{space 3} .0096617
{txt}{space 7}inter {c |}{col 14}{res}{space 2}-.0003138{col 26}{space 2} .0001824{col 37}{space 1}   -1.72{col 46}{space 3}0.085{col 54}{space 4}-.0006713{col 67}{space 3} .0000437
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .2563954{col 26}{space 2} .0051652{col 37}{space 1}   49.64{col 46}{space 3}0.000{col 54}{space 4} .2462717{col 67}{space 3}  .266519
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}reg: mom_high, bandwith: 60, Rectangular kernel

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   163,422
{txt}{hline 13}{c +}{hline 34}   F(3, 163418)    = {res}     2.35
{txt}       Model {c |} {res} 1.32598122         3  .441993741   {txt}Prob > F        ={res}    0.0699
{txt}    Residual {c |} {res} 30683.0043   163,418  .187757801   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res} 30684.3303   163,421  .187762468   {txt}Root MSE        =   {res} .43331

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    mom_high{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}bwtnorm {c |}{col 14}{res}{space 2}  .000021{col 26}{space 2} .0001084{col 37}{space 1}    0.19{col 46}{space 3}0.847{col 54}{space 4}-.0001915{col 67}{space 3} .0002335
{txt}{space 9}cut {c |}{col 14}{res}{space 2} .0038532{col 26}{space 2}  .004967{col 37}{space 1}    0.78{col 46}{space 3}0.438{col 54}{space 4}-.0058821{col 67}{space 3} .0135884
{txt}{space 7}inter {c |}{col 14}{res}{space 2}-.0001882{col 26}{space 2} .0001256{col 37}{space 1}   -1.50{col 46}{space 3}0.134{col 54}{space 4}-.0004343{col 67}{space 3} .0000579
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .251592{col 26}{space 2} .0043564{col 37}{space 1}   57.75{col 46}{space 3}0.000{col 54}{space 4} .2430536{col 67}{space 3} .2601304
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}reg: mom_white, bandwith: 30, triangular kernel
{txt}(sum of wgt is   3.6456e+04)

Linear regression                               Number of obs     = {res}    68,207
                                                {txt}F(3, 68203)       =  {res}     0.59
                                                {txt}Prob > F          = {res}    0.6216
                                                {txt}R-squared         = {res}    0.0000
                                                {txt}Root MSE          =    {res} .47422

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   mom_white{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}bwtnorm {c |}{col 14}{res}{space 2}-.0001789{col 26}{space 2} .0004595{col 37}{space 1}   -0.39{col 46}{space 3}0.697{col 54}{space 4}-.0010795{col 67}{space 3} .0007216
{txt}{space 9}cut {c |}{col 14}{res}{space 2} .0071233{col 26}{space 2}  .011083{col 37}{space 1}    0.64{col 46}{space 3}0.520{col 54}{space 4}-.0145994{col 67}{space 3} .0288461
{txt}{space 7}inter {c |}{col 14}{res}{space 2}  .000397{col 26}{space 2} .0006275{col 37}{space 1}    0.63{col 46}{space 3}0.527{col 54}{space 4} -.000833{col 67}{space 3} .0016269
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .6515227{col 26}{space 2} .0105288{col 37}{space 1}   61.88{col 46}{space 3}0.000{col 54}{space 4} .6308863{col 67}{space 3} .6721592
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}reg: mom_white, bandwith: 30, Rectangular kernel

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}    72,941
{txt}{hline 13}{c +}{hline 34}   F(3, 72937)     = {res}     6.07
{txt}       Model {c |} {res} 4.11035915         3  1.37011972   {txt}Prob > F        ={res}    0.0004
{txt}    Residual {c |} {res} 16451.7692    72,937  .225561364   {txt}R-squared       ={res}    0.0002
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0002
{txt}       Total {c |} {res} 16455.8796    72,940   .22560844   {txt}Root MSE        =   {res} .47493

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   mom_white{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}bwtnorm {c |}{col 14}{res}{space 2}-.0004092{col 26}{space 2} .0004125{col 37}{space 1}   -0.99{col 46}{space 3}0.321{col 54}{space 4}-.0012177{col 67}{space 3} .0003992
{txt}{space 9}cut {c |}{col 14}{res}{space 2} .0165312{col 26}{space 2}  .010414{col 37}{space 1}    1.59{col 46}{space 3}0.112{col 54}{space 4}-.0038801{col 67}{space 3} .0369426
{txt}{space 7}inter {c |}{col 14}{res}{space 2}-.0006892{col 26}{space 2} .0004908{col 37}{space 1}   -1.40{col 46}{space 3}0.160{col 54}{space 4}-.0016512{col 67}{space 3} .0002728
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .6474943{col 26}{space 2} .0099173{col 37}{space 1}   65.29{col 46}{space 3}0.000{col 54}{space 4} .6280564{col 67}{space 3} .6669322
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}reg: mom_high, bandwith: 30, triangular kernel
{txt}(sum of wgt is   3.6456e+04)

Linear regression                               Number of obs     = {res}    68,207
                                                {txt}F(3, 68203)       =  {res}     1.25
                                                {txt}Prob > F          = {res}    0.2910
                                                {txt}R-squared         = {res}    0.0000
                                                {txt}Root MSE          =    {res} .43535

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    mom_high{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}bwtnorm {c |}{col 14}{res}{space 2} .0005457{col 26}{space 2} .0004243{col 37}{space 1}    1.29{col 46}{space 3}0.198{col 54}{space 4} -.000286{col 67}{space 3} .0013775
{txt}{space 9}cut {c |}{col 14}{res}{space 2}-.0073401{col 26}{space 2}  .010231{col 37}{space 1}   -0.72{col 46}{space 3}0.473{col 54}{space 4}-.0273929{col 67}{space 3} .0127127
{txt}{space 7}inter {c |}{col 14}{res}{space 2}-.0010674{col 26}{space 2} .0005751{col 37}{space 1}   -1.86{col 46}{space 3}0.063{col 54}{space 4}-.0021946{col 67}{space 3} .0000597
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .2635726{col 26}{space 2} .0097265{col 37}{space 1}   27.10{col 46}{space 3}0.000{col 54}{space 4} .2445087{col 67}{space 3} .2826365
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}reg: mom_high, bandwith: 30, Rectangular kernel

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}    72,941
{txt}{hline 13}{c +}{hline 34}   F(3, 72937)     = {res}     1.57
{txt}       Model {c |} {res} .885489342         3  .295163114   {txt}Prob > F        ={res}    0.1954
{txt}    Residual {c |} {res} 13750.1196    72,937  .188520498   {txt}R-squared       ={res}    0.0001
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res} 13751.0051    72,940  .188524884   {txt}Root MSE        =   {res} .43419

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    mom_high{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}bwtnorm {c |}{col 14}{res}{space 2} .0006824{col 26}{space 2} .0003771{col 37}{space 1}    1.81{col 46}{space 3}0.070{col 54}{space 4}-.0000567{col 67}{space 3} .0014215
{txt}{space 9}cut {c |}{col 14}{res}{space 2}-.0114803{col 26}{space 2} .0095206{col 37}{space 1}   -1.21{col 46}{space 3}0.228{col 54}{space 4}-.0301406{col 67}{space 3}   .00718
{txt}{space 7}inter {c |}{col 14}{res}{space 2}-.0007758{col 26}{space 2} .0004487{col 37}{space 1}   -1.73{col 46}{space 3}0.084{col 54}{space 4}-.0016553{col 67}{space 3} .0001036
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .2659627{col 26}{space 2} .0090665{col 37}{space 1}   29.33{col 46}{space 3}0.000{col 54}{space 4} .2481924{col 67}{space 3} .2837331
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. ***************
. **     A4    **
. ***************
. 
. ** drump on ounces
. local grams
{txt}
{com}. drop if bweight == 1500
{txt}(3,544 observations deleted)

{com}. forvalues oz = 51(1)54{c -(}
{txt}  2{com}.         local gram = round(`oz'*28.3495)
{txt}  3{com}.         local grams `grams' `gram'
{txt}  4{com}.         gen oz`oz' = 1 if bweight == `gram'
{txt}  5{com}.         replace oz`oz' = 0 if oz`oz' == .
{txt}  6{com}.         gen inter`oz' = oz`oz' * bweight
{txt}  7{com}.         foreach c of local chars{c -(}
{txt}  8{com}.                 display "reg: `c', bandwith: 25, jump: `oz'oz"
{txt}  9{com}.                 regress `c' bweight inter`oz' if abs(bweight-`gram')<= 25
{txt} 10{com}.         {c )-}       
{txt} 11{com}. {c )-}
{txt}(352,828 missing values generated)
(352,828 real changes made)
reg: mom_white, bandwith: 25, jump: 51oz

      Source {c |}       SS           df       MS      Number of obs   ={res}    39,519
{txt}{hline 13}{c +}{hline 34}   F(2, 39516)     = {res}    16.30
{txt}       Model {c |} {res} 7.32609009         2  3.66304505   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 8881.28491    39,516  .224751617   {txt}R-squared       ={res}    0.0008
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0008
{txt}       Total {c |} {res}   8888.611    39,518  .224925629   {txt}Root MSE        =   {res} .47408

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   mom_white{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}bweight {c |}{col 14}{res}{space 2}-.0001695{col 26}{space 2} .0002411{col 37}{space 1}   -0.70{col 46}{space 3}0.482{col 54}{space 4}-.0006421{col 67}{space 3} .0003031
{txt}{space 5}inter51 {c |}{col 14}{res}{space 2} .0000185{col 26}{space 2} 3.31e-06{col 37}{space 1}    5.58{col 46}{space 3}0.000{col 54}{space 4}  .000012{col 67}{space 3}  .000025
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .8900561{col 26}{space 2} .3490609{col 37}{space 1}    2.55{col 46}{space 3}0.011{col 54}{space 4} .2058882{col 67}{space 3} 1.574224
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}reg: mom_high, bandwith: 25, jump: 51oz

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}    39,519
{txt}{hline 13}{c +}{hline 34}   F(2, 39516)     = {res}     0.06
{txt}       Model {c |} {res} .023952681         2  .011976341   {txt}Prob > F        ={res}    0.9383
{txt}    Residual {c |} {res} 7429.87255    39,516  .188021879   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0000
{txt}       Total {c |} {res} 7429.89651    39,518  .188012969   {txt}Root MSE        =   {res} .43361

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    mom_high{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}bweight {c |}{col 14}{res}{space 2}-.0000465{col 26}{space 2} .0002205{col 37}{space 1}   -0.21{col 46}{space 3}0.833{col 54}{space 4}-.0004787{col 67}{space 3} .0003857
{txt}{space 5}inter51 {c |}{col 14}{res}{space 2}-9.25e-07{col 26}{space 2} 3.03e-06{col 37}{space 1}   -0.31{col 46}{space 3}0.760{col 54}{space 4}-6.86e-06{col 67}{space 3} 5.01e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .3190132{col 26}{space 2}  .319267{col 37}{space 1}    1.00{col 46}{space 3}0.318{col 54}{space 4}-.3067578{col 67}{space 3} .9447842
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(349,937 missing values generated)
(349,937 real changes made)
reg: mom_white, bandwith: 25, jump: 52oz

      Source {c |}       SS           df       MS      Number of obs   ={res}    41,928
{txt}{hline 13}{c +}{hline 34}   F(2, 41925)     = {res}     9.61
{txt}       Model {c |} {res} 4.34056971         2  2.17028486   {txt}Prob > F        ={res}    0.0001
{txt}    Residual {c |} {res} 9472.45851    41,925  .225938188   {txt}R-squared       ={res}    0.0005
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0004
{txt}       Total {c |} {res} 9476.79908    41,927  .226030937   {txt}Root MSE        =   {res} .47533

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   mom_white{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}bweight {c |}{col 14}{res}{space 2} .0001701{col 26}{space 2} .0002394{col 37}{space 1}    0.71{col 46}{space 3}0.477{col 54}{space 4}-.0002991{col 67}{space 3} .0006394
{txt}{space 5}inter52 {c |}{col 14}{res}{space 2} .0000135{col 26}{space 2} 3.18e-06{col 37}{space 1}    4.24{col 46}{space 3}0.000{col 54}{space 4} 7.24e-06{col 67}{space 3} .0000197
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .3933215{col 26}{space 2} .3524947{col 37}{space 1}    1.12{col 46}{space 3}0.265{col 54}{space 4}-.2975754{col 67}{space 3} 1.084218
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}reg: mom_high, bandwith: 25, jump: 52oz

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}    41,928
{txt}{hline 13}{c +}{hline 34}   F(2, 41925)     = {res}     1.66
{txt}       Model {c |} {res} .624278477         2  .312139239   {txt}Prob > F        ={res}    0.1898
{txt}    Residual {c |} {res} 7874.85702    41,925   .18783201   {txt}R-squared       ={res}    0.0001
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res}  7875.4813    41,927   .18783794   {txt}Root MSE        =   {res}  .4334

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    mom_high{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}bweight {c |}{col 14}{res}{space 2} .0002277{col 26}{space 2} .0002183{col 37}{space 1}    1.04{col 46}{space 3}0.297{col 54}{space 4}-.0002002{col 67}{space 3} .0006555
{txt}{space 5}inter52 {c |}{col 14}{res}{space 2}-4.60e-06{col 26}{space 2} 2.90e-06{col 37}{space 1}   -1.59{col 46}{space 3}0.112{col 54}{space 4}-.0000103{col 67}{space 3} 1.08e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0809964{col 26}{space 2} .3213976{col 37}{space 1}   -0.25{col 46}{space 3}0.801{col 54}{space 4}-.7109422{col 67}{space 3} .5489495
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(350,984 missing values generated)
(350,984 real changes made)
reg: mom_white, bandwith: 25, jump: 53oz

      Source {c |}       SS           df       MS      Number of obs   ={res}    40,358
{txt}{hline 13}{c +}{hline 34}   F(2, 40355)     = {res}    20.58
{txt}       Model {c |} {res} 9.23959792         2  4.61979896   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 9057.39938    40,355  .224443052   {txt}R-squared       ={res}    0.0010
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0010
{txt}       Total {c |} {res} 9066.63898    40,357  .224660876   {txt}Root MSE        =   {res} .47375

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   mom_white{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}bweight {c |}{col 14}{res}{space 2}  .000516{col 26}{space 2} .0002281{col 37}{space 1}    2.26{col 46}{space 3}0.024{col 54}{space 4} .0000689{col 67}{space 3} .0009631
{txt}{space 5}inter53 {c |}{col 14}{res}{space 2} .0000186{col 26}{space 2} 3.15e-06{col 37}{space 1}    5.90{col 46}{space 3}0.000{col 54}{space 4} .0000124{col 67}{space 3} .0000248
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.1313147{col 26}{space 2} .3426568{col 37}{space 1}   -0.38{col 46}{space 3}0.702{col 54}{space 4}-.8029299{col 67}{space 3} .5403005
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}reg: mom_high, bandwith: 25, jump: 53oz

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}    40,358
{txt}{hline 13}{c +}{hline 34}   F(2, 40355)     = {res}     1.47
{txt}       Model {c |} {res} .558042146         2  .279021073   {txt}Prob > F        ={res}    0.2291
{txt}    Residual {c |} {res} 7641.74824    40,355  .189363108   {txt}R-squared       ={res}    0.0001
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res} 7642.30628    40,357  .189367552   {txt}Root MSE        =   {res} .43516

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    mom_high{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}bweight {c |}{col 14}{res}{space 2}-.0003525{col 26}{space 2} .0002095{col 37}{space 1}   -1.68{col 46}{space 3}0.092{col 54}{space 4}-.0007632{col 67}{space 3} .0000582
{txt}{space 5}inter53 {c |}{col 14}{res}{space 2} 1.20e-06{col 26}{space 2} 2.90e-06{col 37}{space 1}    0.41{col 46}{space 3}0.679{col 54}{space 4}-4.48e-06{col 67}{space 3} 6.87e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .7824427{col 26}{space 2} .3147415{col 37}{space 1}    2.49{col 46}{space 3}0.013{col 54}{space 4} .1655423{col 67}{space 3} 1.399343
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(350,464 missing values generated)
(350,464 real changes made)
reg: mom_white, bandwith: 25, jump: 54oz

      Source {c |}       SS           df       MS      Number of obs   ={res}    43,655
{txt}{hline 13}{c +}{hline 34}   F(2, 43652)     = {res}    12.46
{txt}       Model {c |} {res} 5.60953697         2  2.80476849   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 9824.64473    43,652  .225067459   {txt}R-squared       ={res}    0.0006
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0005
{txt}       Total {c |} {res} 9830.25427    43,654  .225185648   {txt}Root MSE        =   {res} .47441

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   mom_white{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}bweight {c |}{col 14}{res}{space 2} .0002146{col 26}{space 2} .0002319{col 37}{space 1}    0.93{col 46}{space 3}0.355{col 54}{space 4}-.0002399{col 67}{space 3} .0006692
{txt}{space 5}inter54 {c |}{col 14}{res}{space 2} .0000147{col 26}{space 2} 2.97e-06{col 37}{space 1}    4.94{col 46}{space 3}0.000{col 54}{space 4} 8.84e-06{col 67}{space 3} .0000205
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .3173713{col 26}{space 2} .3552408{col 37}{space 1}    0.89{col 46}{space 3}0.372{col 54}{space 4}-.3789071{col 67}{space 3}  1.01365
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}reg: mom_high, bandwith: 25, jump: 54oz

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}    43,655
{txt}{hline 13}{c +}{hline 34}   F(2, 43652)     = {res}     0.49
{txt}       Model {c |} {res} .183012264         2  .091506132   {txt}Prob > F        ={res}    0.6153
{txt}    Residual {c |} {res} 8226.09952    43,652  .188447254   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0000
{txt}       Total {c |} {res} 8226.28253    43,654  .188442812   {txt}Root MSE        =   {res} .43411

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    mom_high{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}bweight {c |}{col 14}{res}{space 2} .0001449{col 26}{space 2} .0002122{col 37}{space 1}    0.68{col 46}{space 3}0.495{col 54}{space 4} -.000271{col 67}{space 3} .0005609
{txt}{space 5}inter54 {c |}{col 14}{res}{space 2}-1.86e-06{col 26}{space 2} 2.72e-06{col 37}{space 1}   -0.68{col 46}{space 3}0.494{col 54}{space 4}-7.18e-06{col 67}{space 3} 3.47e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0313763{col 26}{space 2} .3250584{col 37}{space 1}    0.10{col 46}{space 3}0.923{col 54}{space 4}-.6057441{col 67}{space 3} .6684968
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. ** drump on 1500
. 
. use `raw' , clear
{txt}
{com}. 
. gen is1500 = 1 if bweight==1500
{txt}(372,864 missing values generated)

{com}. replace is1500=0 if is1500==.
{txt}(372,864 real changes made)

{com}. gen inter2 = is1500 * bweight
{txt}
{com}. 
. foreach g of local grams{c -(}
{txt}  2{com}.         drop if bweight == `g'
{txt}  3{com}. {c )-}
{txt}(20,036 observations deleted)
(22,927 observations deleted)
(21,880 observations deleted)
(22,400 observations deleted)

{com}. 
. foreach c of local chars{c -(}
{txt}  2{com}.                 display "reg: `c', bandwith: 25 jump: 1500g"
{txt}  3{com}.                 regress `c' bweight inter2 if abs(bweight- 1500)<= 25
{txt}  4{com}.         {c )-}
reg: mom_white, bandwith: 25 jump: 1500g

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}    22,613
{txt}{hline 13}{c +}{hline 34}   F(2, 22610)     = {res}     3.63
{txt}       Model {c |} {res} 1.67224738         2  .836123689   {txt}Prob > F        ={res}    0.0265
{txt}    Residual {c |} {res} 5203.96168    22,610   .23016195   {txt}R-squared       ={res}    0.0003
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0002
{txt}       Total {c |} {res} 5205.63393    22,612  .230215546   {txt}Root MSE        =   {res} .47975

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   mom_white{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}bweight {c |}{col 14}{res}{space 2} .0002922{col 26}{space 2} .0002211{col 37}{space 1}    1.32{col 46}{space 3}0.186{col 54}{space 4}-.0001412{col 67}{space 3} .0007256
{txt}{space 6}inter2 {c |}{col 14}{res}{space 2}-.0000137{col 26}{space 2} 5.85e-06{col 37}{space 1}   -2.34{col 46}{space 3}0.019{col 54}{space 4}-.0000252{col 67}{space 3}-2.24e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .2055841{col 26}{space 2} .3317622{col 37}{space 1}    0.62{col 46}{space 3}0.535{col 54}{space 4}-.4446926{col 67}{space 3} .8558608
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}reg: mom_high, bandwith: 25 jump: 1500g

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}    22,613
{txt}{hline 13}{c +}{hline 34}   F(2, 22610)     = {res}     2.60
{txt}       Model {c |} {res} .984860652         2  .492430326   {txt}Prob > F        ={res}    0.0744
{txt}    Residual {c |} {res} 4283.47143    22,610  .189450306   {txt}R-squared       ={res}    0.0002
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0001
{txt}       Total {c |} {res} 4284.45629    22,612  .189477104   {txt}Root MSE        =   {res} .43526

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    mom_high{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}bweight {c |}{col 14}{res}{space 2}-.0001323{col 26}{space 2} .0002006{col 37}{space 1}   -0.66{col 46}{space 3}0.510{col 54}{space 4}-.0005255{col 67}{space 3} .0002609
{txt}{space 6}inter2 {c |}{col 14}{res}{space 2} .0000116{col 26}{space 2} 5.31e-06{col 37}{space 1}    2.18{col 46}{space 3}0.029{col 54}{space 4} 1.16e-06{col 67}{space 3}  .000022
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .4497102{col 26}{space 2} .3009939{col 37}{space 1}    1.49{col 46}{space 3}0.135{col 54}{space 4}-.1402587{col 67}{space 3} 1.039679
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. log close _all
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}D:\Lindo\Assignments\Assignment5\mylog.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}23 Mar 2017, 07:38:16
{txt}{.-}
{smcl}
{txt}{sf}{ul off}